>>> Select Application By AID:
    -> 90 5a 00 00 03 00 00 00 | 00 
    <- 91 00 

>>> Start AES Authenticate:
    -> 90 aa 00 00 01 00 00 
    <- f6 51 b4 27 80 bd 9b 0b | a5 9a de a2 a6 0a 24 a1 | 91 af 
    -- RNDA = 4d 56 0e b5 07 d2 b2 eb 
    -- RNDB = 01 ec 21 9d 6c 70 f3 80 
    -- CHAL = 4d 56 0e b5 07 d2 b2 eb | 80 01 ec 21 9d 6c 70 f3 
    -> 90 af 00 00 10 eb 8d 7a | 5f 8d d3 44 b3 22 61 0c | 97 7b 13 57 b5 00 
    <- f0 e6 92 44 d8 29 fc 16 | 46 71 c2 0e ec 33 ea db | 91 00 
       ... AUTH OK! :)

>>> CreateApplication command:
    -> 90 ca 00 00 05 01 00 34 | 0f 03 00 
    <- 91 de 
>>> Select Application By AID:
    -> 90 5a 00 00 03 01 00 34 | 00 
    <- 91 00 

>>> Start AES Authenticate:
    -> 90 aa 00 00 01 00 00 
    <- f1 07 00 2f 70 ce 86 d4 | cb 0b 17 47 9c 43 76 11 | 91 af 
    -- RNDA = 8f 17 e5 20 f7 cc 78 c2 
    -- RNDB = 55 62 ec 73 ce 9e 9a 88 
    -- CHAL = 8f 17 e5 20 f7 cc 78 c2 | 88 55 62 ec 73 ce 9e 9a 
    -> 90 af 00 00 10 27 bf 7a | d4 4c 32 2a e3 73 da 18 | 4e 2a 7f c5 b6 00 
    <- a0 8e e3 5f 50 ee f1 38 | 39 75 41 e3 e2 25 69 04 | 91 00 
       ... AUTH OK! :)

>>> CreateStdDataFile command:
    -> 90 cd 00 00 07 00 00 0f | 00 04 00 00 00 
    <- 91 de 

>>> CreateBackupDataFile command:
    -> 90 cb 00 00 07 01 00 0f | 00 08 00 00 00 
    <- 91 de 

>>> GetFileIds command:
    -> 90 6f 00 00 00 00 
    <- 00 01 91 00 
>>> ReadData command:
    -> 90 bd 00 00 07 00 00 00 | 00 04 00 00 00 
    <- 8f f9 2d 9f 91 00 
>>> DeleteFile command:
    -> 90 df 00 00 01 01 00 
    <- 91 00 
>>> GetFileIds command:
    -> 90 6f 00 00 00 00 
    <- 00 91 00 
>>> ReadData command:
    -> 90 bd 00 00 07 00 00 00 | 00 04 00 00 00 
    <- 8f f9 2d 9f 91 00 
>>> ReadData command:
    -> 90 bd 00 00 07 00 02 00 | 00 02 00 00 00 
    <- 8f f9 91 00 
>>> WriteData command:
    -> 90 3d 00 00 0b 00 00 00 | 00 04 00 00 00 00 00 00 | 00 
    <- 91 00 
>>> ReadData command:
    -> 90 bd 00 00 07 00 00 00 | 00 04 00 00 00 
    <- 00 00 00 00 91 00 
>>> WriteData command:
    -> 90 3d 00 00 09 00 02 00 | 00 02 00 00 04 05 00 
    <- 91 00 
>>> ReadData command:
    -> 90 bd 00 00 07 00 00 00 | 00 04 00 00 00 
    <- 8f 09 04 05 91 00 
