>>> CreateApplication command:
    -> 90 ca 00 00 05 f3 12 34 | 0f 03 00 
    <- 91 00 
>>> Select Application By AID:
    -> 90 5a 00 00 03 f3 12 34 | 00 
    <- 91 00 

>>> Start AES Authenticate:
    -> 90 aa 00 00 01 00 00 
    <- d8 66 18 da d4 dd d4 88 | 0d 79 92 f9 fc 0b 7c fc | 91 af 
    -- RNDA = 5e ee 23 2c fe 89 f0 2c 
    -- RNDB = fe 86 52 d8 30 e9 c4 02 
    -- CHAL = 5e ee 23 2c fe 89 f0 2c | 02 fe 86 52 d8 30 e9 c4 
    -> 90 af 00 00 10 b9 99 5d | 84 a9 88 d5 69 e1 0b 76 | e1 eb 8a a6 6f 00 
    <- 49 b1 da 35 ca b0 0d 32 | 65 a6 74 17 94 f7 8e 70 | 91 00 
       ... AUTH OK! :)

>>> CreateValueFile command:
    -> 90 cc 00 00 11 02 00 0f | 00 00 00 00 00 00 01 00 | 00 80 00 00 00 01 00 
    <- 91 00 

>>> GetFileIds command:
    -> 90 6f 00 00 00 00 
    <- 02 91 00 
>>> GetValue command:
    -> 90 6c 00 00 01 02 00 
    <- 80 00 00 00 91 00 
>>> Credit(ValueFile) command:
    -> 90 0c 00 00 05 02 40 00 | 00 00 00 
    <- 91 00 
>>> GetValue command:
    -> 90 6c 00 00 01 02 00 
    <- 80 00 00 00 91 00 
>>> Debit(ValueFile) command:
    -> 90 dc 00 00 05 02 40 00 | 00 00 00 
    <- 91 00 
>>> GetValue command:
    -> 90 6c 00 00 01 02 00 
    <- 80 00 00 00 91 00 
>>> LimitedCredit(ValueFile) command:
    -> 90 1c 00 00 05 02 20 00 | 00 00 00 
    <- 91 00 
>>> GetValue command:
    -> 90 6c 00 00 01 02 00 
    <- 80 00 00 00 91 00 
>>> CommitTransaction command:
    -> 90 c7 00 00 00 00 
    <- 91 00 
>>> GetValue command:
    -> 90 6c 00 00 01 02 00 
    <- a0 00 00 00 91 00 
>>> Debit(ValueFile) command:
    -> 90 dc 00 00 05 02 c8 00 | 00 00 00 
    <- 91 be 
>>> CommitTransaction command:
    -> 90 c7 00 00 00 00 
    <- 91 00 
>>> GetValue command:
    -> 90 6c 00 00 01 02 00 
    <- a0 00 00 00 91 00 
>>> CreateValueFile command:
    -> 90 cc 00 00 11 03 00 0f | 00 00 00 00 00 00 01 00 | 00 80 00 00 00 00 00 
    <- 91 00 

>>> GetFileIds command:
    -> 90 6f 00 00 00 00 
    <- 02 03 91 00 
>>> GetValue command:
    -> 90 6c 00 00 01 03 00 
    <- 80 00 00 00 91 00 
>>> Credit(ValueFile) command:
    -> 90 0c 00 00 05 03 40 00 | 00 00 00 
    <- 91 00 
>>> GetValue command:
    -> 90 6c 00 00 01 03 00 
    <- 80 00 00 00 91 00 
>>> Debit(ValueFile) command:
    -> 90 dc 00 00 05 03 40 00 | 00 00 00 
    <- 91 00 
>>> GetValue command:
    -> 90 6c 00 00 01 03 00 
    <- 80 00 00 00 91 00 
>>> LimitedCredit(ValueFile) command:
    -> 90 1c 00 00 05 03 20 00 | 00 00 00 
    <- 91 9d 
>>> GetValue command:
    -> 90 6c 00 00 01 03 00 
    <- 80 00 00 00 91 00 
>>> AbortTransaction command:
    -> 90 a7 00 00 00 00 
    <- 91 00 
>>> GetValue command:
    -> 90 6c 00 00 01 03 00 
    <- 80 00 00 00 91 00 
